{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting two features: replacing the SVG icon with voxa-logo.png in HeroSection.tsx and Navigation.tsx, with associated test IDs and component references.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of key frontend files including index.css, IntroSection.tsx, HeroSection.tsx, and Navigation.tsx, describing their roles and recent changes.",
  "frontend/index.css": "Tailwind CSS entry file that defines OKLCH-based CSS custom properties for light and dark themes covering colors, borders, charts, and sidebar tokens.",
  "frontend/index.html": "HTML entry point for the Vite/React app, setting the page title, description meta tag, and mounting the React root div.",
  "frontend/src/App.tsx": "Root React component that composes all page sections, manages scroll progress tracking, and uses IntersectionObserver to highlight the active navigation section.",
  "frontend/src/components/HeroSection.tsx": "Hero section component featuring an animated particle canvas background, the VOXA logo image at 72×72 px, title, description, CTA buttons, and a scroll-to-first-section trigger.",
  "frontend/src/components/Navigation.tsx": "Sticky navigation bar displaying the VOXA logo image at 28×28 px, desktop section links with active-state highlighting, and a responsive mobile dropdown menu.",
  "frontend/src/components/ScrollProgressIndicator.tsx": "Component that tracks window scroll position and renders a progress bar reflecting how far the user has scrolled down the page.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact section displaying links to two VOXA prototypes, a newsletter email subscription form with success state, and social media icons.",
  "frontend/src/components/sections/ExtraInfoSection.tsx": "Renders an 'About VOXA' section displaying platform attribute cards and an accordion-style FAQ list, with intersection-observer-based reveal animations.",
  "frontend/src/components/sections/FeaturesSection.tsx": "Displays a grid of ten VOXA platform features (icons + descriptions) with scroll-triggered reveal animations using IntersectionObserver.",
  "frontend/src/components/sections/IntroSection.tsx": "Introduces VOXA with a bullet-point list of key platform values alongside an animated phone mockup showing a mood selector and sample chat UI.",
  "frontend/src/components/sections/ProblemSection.tsx": "Renders a grid of 15 youth mental health problem cards with emoji icons and scroll-triggered animations, ending with a reassuring note about VOXA's mission.",
  "frontend/src/components/sections/RevenueSection.tsx": "Shows VOXA's business model with animated market-stat cards and progress-bar revenue streams that animate in when the section scrolls into view.",
  "frontend/src/components/sections/RoadmapSection.tsx": "Presents a two-column roadmap layout listing currently live features and upcoming planned features, with scroll-triggered reveal animations.",
  "frontend/src/components/sections/SolutionSection.tsx": "Renders a grid of 8 solution cards for VOXA's mental health platform, each with a CheckCircle icon, title, and description, with scroll-triggered reveal animations via IntersectionObserver.",
  "frontend/src/components/sections/TechStackSection.tsx": "Displays VOXA's development principles as icon cards and a technology stack badge grid, with scroll-triggered reveal animations.",
  "frontend/src/components/sections/YouthBenefitsSection.tsx": "Renders a grid of 7 cards explaining how VOXA addresses youth mental health problems, each with a Lucide icon, title, and description, animated on scroll.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and persisted identity state via AuthClient.",
  "frontend/src/hooks/useIntersectionObserver.ts": "Custom hook that tracks which section from a list of IDs is currently visible in the viewport using IntersectionObserver, returning the active section ID.",
  "frontend/src/hooks/useScrollReveal.ts": "Custom hook that uses IntersectionObserver to set a visibility flag when a referenced element scrolls into view, unobserving it afterward.",
  "frontend/src/index.css": "Global stylesheet defining OKLCH design tokens for VOXA's dark theme, base resets, and component styles including navigation, scroll progress bar, and utility classes using Tailwind and custom CSS.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom OKLCH-based color tokens, extended font families (Inter, Space Grotesk), border radii, and custom animations/keyframes. Includes the tailwindcss-animate and @tailwindcss/typography plugins.",
  "project_state.json": "Tracks the current state of a single-page landing page project for the VOXA app, recording schema version, architectural notes, existing features, known issues, and image requirements. Serves as a build-planning reference for a dark-themed HTML/CSS/JS scrolling page with 10 content sections."
}